<?php

/*
 * 1. Написать фунцию для нахожения минимального и максимального значения элементов массива. Использовать стандартные
 * функции языка типа min($array) и max($array) запрещенно.
 *
 * 2. Написать функцию для определение является ли строка палиндромом или нет. Функция должна возвращать булевое значение.
 * Палиндром это строка которая читается одинаково с конца как и с начала. Например "Мадам", "Шалаш", "Аргентина манит негра"
 *
 * 3. Написать функцию для поверки номер платежной карты используя формулу Луна
 *  https://ru.wikipedia.org/wiki/%D0%90%D0%BB%D0%B3%D0%BE%D1%80%D0%B8%D1%82%D0%BC_%D0%9B%D1%83%D0%BD%D0%B0
 * Функция должна возвращать булевое значение: true если номер правильный или false если нет.
 *
 */

function minMax(array $numbers)
{

}

function palindrome(string $str)
{
//	return strrev($str);

	parse_str($str, $output);

	return $output;
}



//echo palindrome("Мадам1");
var_dump(palindrome("Мадам1"));